; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 7845)
	(= (fuel plane1) 2590)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at person1 city0)
	(at person2 city3)
	(at person3 city1)
	(at person4 city1)
	(at person5 city3)
	(at person6 city4)
	(at person7 city2)
	(at person8 city0)
	(at person9 city0)
	(at person10 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 677)
	(= (distance city0 city2) 836)
	(= (distance city0 city3) 757)
	(= (distance city0 city4) 638)
	(= (distance city0 city5) 991)
	(= (distance city1 city0) 677)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 891)
	(= (distance city1 city3) 692)
	(= (distance city1 city4) 696)
	(= (distance city1 city5) 523)
	(= (distance city2 city0) 836)
	(= (distance city2 city1) 891)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 617)
	(= (distance city2 city4) 551)
	(= (distance city2 city5) 693)
	(= (distance city3 city0) 757)
	(= (distance city3 city1) 692)
	(= (distance city3 city2) 617)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 988)
	(= (distance city3 city5) 865)
	(= (distance city4 city0) 638)
	(= (distance city4 city1) 696)
	(= (distance city4 city2) 551)
	(= (distance city4 city3) 988)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 662)
	(= (distance city5 city0) 991)
	(= (distance city5 city1) 523)
	(= (distance city5 city2) 693)
	(= (distance city5 city3) 865)
	(= (distance city5 city4) 662)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city1)
	(at person2 city3)
	(at person3 city0)
	(at person4 city5)
	(at person5 city5)
	(at person7 city4)
	(at person8 city0)
	(at person9 city3)
	(at person10 city3)
	))

(:metric minimize (+ (* 4 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (board person7 plane1 city2)
   deleted: (at person7 city2)
   added: (in person7 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 9
2. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 2508, (fuel plane1) from 2590 to 82
   goals met: 2 of 9
3. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 9
4. (board person9 plane1 city0)
   deleted: (at person9 city0)
   added: (in person9 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 2 of 9
5. (refuel plane1 city0)
   changed: (fuel plane1) from 82 to 7845
   goals met: 2 of 9
6. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 2508 to 4539, (fuel plane1) from 7845 to 5814
   goals met: 2 of 9
7. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   changed: (onboard plane1) from 3 to 2
   goals met: 3 of 9
8. (board person3 plane1 city1)
   deleted: (at person3 city1)
   added: (in person3 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 9
9. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 3 of 9
10. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 4539 to 6570, (fuel plane1) from 5814 to 3783
   goals met: 3 of 9
11. (debark person3 plane1 city0)
   deleted: (in person3 plane1)
   added: (at person3 city0)
   changed: (onboard plane1) from 4 to 3
   goals met: 4 of 9
12. (fly plane1 city0 city5)
   deleted: (at plane1 city0)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 6570 to 9543, (fuel plane1) from 3783 to 810
   goals met: 4 of 9
13. (debark person4 plane1 city5)
   deleted: (in person4 plane1)
   added: (at person4 city5)
   changed: (onboard plane1) from 3 to 2
   goals met: 5 of 9
14. (board person10 plane1 city5)
   deleted: (at person10 city5)
   added: (in person10 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 5 of 9
15. (refuel plane1 city5)
   changed: (fuel plane1) from 810 to 7845
   goals met: 5 of 9
16. (fly plane1 city5 city4)
   deleted: (at plane1 city5)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 9543 to 11529, (fuel plane1) from 7845 to 5859
   goals met: 5 of 9
17. (debark person7 plane1 city4)
   deleted: (in person7 plane1)
   added: (at person7 city4)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 9
18. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 11529 to 14493, (fuel plane1) from 5859 to 2895
   goals met: 6 of 9
19. (debark person9 plane1 city3)
   deleted: (in person9 plane1)
   added: (at person9 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 9
20. (debark person10 plane1 city3)
   deleted: (in person10 plane1)
   added: (at person10 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 9
21. (board person5 plane1 city3)
   deleted: (at person5 city3)
   added: (in person5 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 8 of 9
22. (fly plane1 city3 city5)
   deleted: (at plane1 city3)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 14493 to 17088, (fuel plane1) from 2895 to 300
   goals met: 8 of 9
23. (debark person5 plane1 city5)
   deleted: (in person5 plane1)
   added: (at person5 city5)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 9
